335134701/STC89C52_Demo/OLED_BMP/OLED_BMP_V1.0.0.0/Headers.h
#ifndef __HEADERS_H__
#define __HEADERS_H__

#include <reg52.h>
#include "OLED_Main.h"
#include "OLED_Code.h"
#include "OLED_Method.h"



#pragma SAVE

#if defined (__CX2__)
#pragma FUNCTIONS(STATIC)


/* intrinsic functions are reentrant, but need static attribute */
#endif

extern void          _nop_     (void);
extern bit           _testbit_ (bit);
extern unsigned char _cror_    (unsigned char, unsigned char);
extern unsigned int  _iror_    (unsigned int,  unsigned char);
extern unsigned long _lror_    (unsigned long, unsigned char);
extern unsigned char _crol_    (unsigned char, unsigned char);
extern unsigned int  _irol_    (unsigned int,  unsigned char);
extern unsigned long _lrol_    (unsigned long, unsigned char);
extern unsigned char _chkfloat_(float);
#if defined (__CX2__)
extern int           abs       (int);
extern void          _illop_   (void);
#endif
#if !defined (__CX2__)
extern void          _push_    (unsigned char _sfr);
extern void          _pop_     (unsigned char _sfr);
#endif

#pragma RESTORE



#endif